package com.lianzai.reader.bean;

import com.lianzai.reader.utils.RxTool;

/**
 * Created by lrz on 2018/1/3.
 */

public class BookChapterDetailBean {


    /**
     * code : 200
     * msg : 信息拉取成功
     * data : {"chapterInfo":{"id":26907,"uid":36927,"novelId":101,"volumeId":5,"serPath":18,"title":"第十八章 千里尤遵","introduce":"","price":0,"wordNum":2184,"status":1,"type":0,"vipCer":0,"shelfTime":1518010477,"createTime":1518010477,"updateTime":1518010477,"originalContent":"\n冉仲弓挣扎了一把，背后的绳索却是牛筋做的异常坚韧，他挣扎几番却愈来愈紧。\n申公义已然走到近前，伸手抓住冉仲弓狠狠一抛。\n冉仲弓只觉得天旋地转，随即重重地落在了马背上。他还不明所以，便见申公义用一页刀的刀鞘狠狠地抽了一下冉仲弓的马的屁股。\n那马痛得嘶鸣一声撒开前蹄疾奔而去。\n冉仲弓只觉得马背上颠簸，险些将他颠下马来。他忙发力稳住身形，转脸看向申公义的身影离自己愈来愈远。\n还未等他如何缓过神来，便见申公义翻身上了另一匹马，一夹马肚便追及而来。\n冉仲弓双手被缚无法驱策马匹，只能信马由缰，极快地便被申公义复追上。\n\u201c妈的若不是你申公明怎的会死！\u201d申公义破口骂着一把拿起刀鞘狠狠地抽在冉仲弓的后脑之上。\n冉仲弓只听见自己脑颅内\u201c梆！\u201d的一声，两眼便悠悠发蒙，身子险些支持不住跌落下马。\n那申公义驱马凑近一把揪住冉仲弓的头发用力地将冉仲弓的脸摔在马鞍上，只听见冉仲弓闷哼一声，鲜血一串串地洒落在地。\n这沙子贪婪至极，一口口将鲜血吞入腹中。\n\u201c你为何不再自作聪明了！\u201d申公义只手将冉仲弓连着马匹一同拉到身前，两眼怒视着，似乎要将一股没由来的脾气全都发在冉仲弓身上。\n冉仲弓只能感觉自己身上一次又一次地遭受重击，可他从第一下被打中了头颅就已然七荤八素，两眼直冒金星。\n\u201c你倒是答啊！此时为何不做声？！\u201d\n申公义的拳头混着刀鞘一下一下打在冉仲弓的脊背之上发着闷响。冉仲弓觉得两耳嗡嗡响，已然听不真切此人在说些甚么。\n\u201c你最好把你先前所见到的一切事都给我统统忘记！\u201d申公义将刀鞘交于另一只手，抡起巴掌狠狠一掌打在了冉仲弓的头上。\n冉仲弓闷哼一声，两眼一黑，再无知觉。\n再醒来时，冉仲弓只觉得口中干渴，头上剧痛。迷迷糊糊半天，才悠悠转醒。\n方一睁眼便见到一轮烈日，直刺他的双眼。\n冉仲弓眯着眼，一时忘记自己是谁，此地是何地，只感觉两耳充满蜂鸣声，眼前太阳的灼光都开始变了颜色。\n\u201c踏...踏...\u201d\n冉仲弓听见耳边有脚步声，紧接着模糊的视线里便出现了一个人形，将烈日遮蔽，影子刚好投射在自己的脸上。\n那人蹲下身来拿手粗鲁地扒拉开他的眼皮，冉仲弓觉得眼中不适，微微一挣。\n\u201c你娘的！装死！\u201d那人见冉仲弓尚还能动，抡圆了巴掌一耳光打将上来\u201c啪！\u201d的一声。\n冉仲弓被打的有了几分清醒，挣扎着抬头眯起眼望向那人，这才认出此人是申公义。\n\u201c你他娘为何不直接杀了我。\u201d冉仲弓干咳着，他刚刚定是被打晕了过去跌落下马吃了一嘴沙子。\n\u201c老子杀了你，谁杀了申公明？\u201d申公义一把拎着冉仲弓的后心将他一把又揪回马背上。\n这次他没再殴打冉仲弓，而是不断地开口辱骂。\n冉仲弓本身不知他为何忽然如此暴躁，可将先前的一幕幕景一句句话都串联起来便恍然。\n此人自清池山一战弃了两个同伴逃离，回到家族定少不了一番询问。\n他只能扯了个谎，好容易瞒天过海，本以为此事只有天知地知公输伯阳知，却忘记了当日和公输伯阳在一起的自己。\n而此时再度遇见，自己险些将他辛苦编的谎言一口戳破，情急之下只得再次暗算同伴，这才保住了自己。\n冉仲弓有些明白前日里酒肉烟曾同他讲的\u201c名声\u201d究竟暗藏多少含义。\n因为名声可以使人万里助拳，也可能一生被\u201c名\u201d字所累。\n可冉仲弓不敢开口嘲笑。此人是他所见的一切恶徒中最可能不由分说便将自己打死的。若是自己失言，今日怕是性命不保。\n他本身还为自己的退避有些气闷，后来他转念一想，自己尚还未寻到曲白，此时若是丢了性命那又怎行。\n如此想来他心情便平复了不少，听得那申公义的辱骂，权当是一条野狗在胡吠乱叫，自己闭上了眼不理睬，待那申公义追上先前离去的那三人后瞧他还如何啰嗦。\n可他料想不到，他同申公义一路疾驰，直赶了大半个月，都再未见到其他人的身影。\n四周的景色有荒凉逐渐再出现生机。由平原到丘陵，由海入林。\n一望无垠的沙终于也有了边界，尤遵沙漠愈来愈远了，在遥遥地戈壁边界，望了如此之久的沙黄色中出现了星星点点的绿意。\n\u201c这是何地？\u201d冉仲弓这半个月来从未主动同申公义说过话。申公义前些日子还总是开口辱骂冉仲弓，冉仲弓也从未回答。而后似乎是骂的累，亦或是未得到回应骂的烦了，近两日再未开过口。\n两个人只知道赶路，入夜了便修整。那时申公义会给冉仲弓松绑。\n冉仲弓本想等那申公义点自己的穴位，自己使出碧落诀从而脱身，可不知这申公义究竟是运气好还是有意如此，都是用一页刀的刀鞘点了他的穴位。\n次次如此。\n。\n他给冉仲弓松了绑，便将两匹马拉到一起，而后用绳子捆在自己的衣服上。\n若是冉仲弓一有异动，他便能转瞬惊醒。\n冉仲弓心知在这沙漠当中没有制服申公义，自己无论如何也没逃不脱，便不再有逃跑的念头，可他见到了眼前这几抹绿色，眼睛便忽然瞟向申公义。\n\u201c怎的？酒肉烟大侠猜测不出？\u201d申公义冷嘲热讽、\n冉仲弓心说酒肉烟老哥见多识广，肯定会知道。可自己涉世未深，未去过如何遥远的地方。只知道他们一路顺着尤遵朝南走来，若是猜得不错，此地应是句井家的地盘。\n他不明白为何申公义会来句井家，但他却不发问，因为他知道申公义决计不会同他说。\n申公义领着冉仲弓策马离开了戈壁滩，眼前的植被愈发茂盛，已然是要彻底离开沙漠的范畴。\n马匹一路上未吃喝甚么，若不是这两匹马都乃驯良，如此奔袭早该一命呜呼。纵然如此，半个月的赶路也已费尽了这两匹马的一切精神。\n此时它们两匹马见得嫩草，如何也迈不开腿了。\n申公义只得将冉仲弓拉下马来，暂作休整。\n冉仲弓被丢在树下，申公义顺手用刀鞘点了冉仲弓的穴位，松开了冉仲弓手中的牛皮绳。\n冉仲弓眼神瞟向正在拆解马嚼子的申公义，心中微动。","content":"<p>冉仲弓挣扎了一把，背后的绳索却是牛筋做的异常坚韧，他挣扎几番却愈来愈紧。<p>申公义已然走到近前，伸手抓住冉仲弓狠狠一抛。<p>冉仲弓只觉得天旋地转，随即重重地落在了马背上。他还不明所以，便见申公义用一页刀的刀鞘狠狠地抽了一下冉仲弓的马的屁股。<p>那马痛得嘶鸣一声撒开前蹄疾奔而去。<p>冉仲弓只觉得马背上颠簸，险些将他颠下马来。他忙发力稳住身形，转脸看向申公义的身影离自己愈来愈远。<p>还未等他如何缓过神来，便见申公义翻身上了另一匹马，一夹马肚便追及而来。<p>冉仲弓双手被缚无法驱策马匹，只能信马由缰，极快地便被申公义复追上。<p>\u201c妈的若不是你申公明怎的会死！\u201d申公义破口骂着一把拿起刀鞘狠狠地抽在冉仲弓的后脑之上。<p>冉仲弓只听见自己脑颅内\u201c梆！\u201d的一声，两眼便悠悠发蒙，身子险些支持不住跌落下马。<p>那申公义驱马凑近一把揪住冉仲弓的头发用力地将冉仲弓的脸摔在马鞍上，只听见冉仲弓闷哼一声，鲜血一串串地洒落在地。<p>这沙子贪婪至极，一口口将鲜血吞入腹中。<p>\u201c你为何不再自作聪明了！\u201d申公义只手将冉仲弓连着马匹一同拉到身前，两眼怒视着，似乎要将一股没由来的脾气全都发在冉仲弓身上。<p>冉仲弓只能感觉自己身上一次又一次地遭受重击，可他从第一下被打中了头颅就已然七荤八素，两眼直冒金星。<p>\u201c你倒是答啊！此时为何不做声？！\u201d<p>申公义的拳头混着刀鞘一下一下打在冉仲弓的脊背之上发着闷响。冉仲弓觉得两耳嗡嗡响，已然听不真切此人在说些甚么。<p>\u201c你最好把你先前所见到的一切事都给我统统忘记！\u201d申公义将刀鞘交于另一只手，抡起巴掌狠狠一掌打在了冉仲弓的头上。<p>冉仲弓闷哼一声，两眼一黑，再无知觉。<p>再醒来时，冉仲弓只觉得口中干渴，头上剧痛。迷迷糊糊半天，才悠悠转醒。<p>方一睁眼便见到一轮烈日，直刺他的双眼。<p>冉仲弓眯着眼，一时忘记自己是谁，此地是何地，只感觉两耳充满蜂鸣声，眼前太阳的灼光都开始变了颜色。<p>\u201c踏...踏...\u201d<p>冉仲弓听见耳边有脚步声，紧接着模糊的视线里便出现了一个人形，将烈日遮蔽，影子刚好投射在自己的脸上。<p>那人蹲下身来拿手粗鲁地扒拉开他的眼皮，冉仲弓觉得眼中不适，微微一挣。<p>\u201c你娘的！装死！\u201d那人见冉仲弓尚还能动，抡圆了巴掌一耳光打将上来\u201c啪！\u201d的一声。<p>冉仲弓被打的有了几分清醒，挣扎着抬头眯起眼望向那人，这才认出此人是申公义。<p>\u201c你他娘为何不直接杀了我。\u201d冉仲弓干咳着，他刚刚定是被打晕了过去跌落下马吃了一嘴沙子。<p>\u201c老子杀了你，谁杀了申公明？\u201d申公义一把拎着冉仲弓的后心将他一把又揪回马背上。<p>这次他没再殴打冉仲弓，而是不断地开口辱骂。<p>冉仲弓本身不知他为何忽然如此暴躁，可将先前的一幕幕景一句句话都串联起来便恍然。<p>此人自清池山一战弃了两个同伴逃离，回到家族定少不了一番询问。<p>他只能扯了个谎，好容易瞒天过海，本以为此事只有天知地知公输伯阳知，却忘记了当日和公输伯阳在一起的自己。<p>而此时再度遇见，自己险些将他辛苦编的谎言一口戳破，情急之下只得再次暗算同伴，这才保住了自己。<p>冉仲弓有些明白前日里酒肉烟曾同他讲的\u201c名声\u201d究竟暗藏多少含义。<p>因为名声可以使人万里助拳，也可能一生被\u201c名\u201d字所累。<p>可冉仲弓不敢开口嘲笑。此人是他所见的一切恶徒中最可能不由分说便将自己打死的。若是自己失言，今日怕是性命不保。<p>他本身还为自己的退避有些气闷，后来他转念一想，自己尚还未寻到曲白，此时若是丢了性命那又怎行。<p>如此想来他心情便平复了不少，听得那申公义的辱骂，权当是一条野狗在胡吠乱叫，自己闭上了眼不理睬，待那申公义追上先前离去的那三人后瞧他还如何啰嗦。<p>可他料想不到，他同申公义一路疾驰，直赶了大半个月，都再未见到其他人的身影。<p>四周的景色有荒凉逐渐再出现生机。由平原到丘陵，由海入林。<p>一望无垠的沙终于也有了边界，尤遵沙漠愈来愈远了，在遥遥地戈壁边界，望了如此之久的沙黄色中出现了星星点点的绿意。<p>\u201c这是何地？\u201d冉仲弓这半个月来从未主动同申公义说过话。申公义前些日子还总是开口辱骂冉仲弓，冉仲弓也从未回答。而后似乎是骂的累，亦或是未得到回应骂的烦了，近两日再未开过口。<p>两个人只知道赶路，入夜了便修整。那时申公义会给冉仲弓松绑。<p>冉仲弓本想等那申公义点自己的穴位，自己使出碧落诀从而脱身，可不知这申公义究竟是运气好还是有意如此，都是用一页刀的刀鞘点了他的穴位。<p>次次如此。<p>。<p>他给冉仲弓松了绑，便将两匹马拉到一起，而后用绳子捆在自己的衣服上。<p>若是冉仲弓一有异动，他便能转瞬惊醒。<p>冉仲弓心知在这沙漠当中没有制服申公义，自己无论如何也没逃不脱，便不再有逃跑的念头，可他见到了眼前这几抹绿色，眼睛便忽然瞟向申公义。<p>\u201c怎的？酒肉烟大侠猜测不出？\u201d申公义冷嘲热讽、<p>冉仲弓心说酒肉烟老哥见多识广，肯定会知道。可自己涉世未深，未去过如何遥远的地方。只知道他们一路顺着尤遵朝南走来，若是猜得不错，此地应是句井家的地盘。<p>他不明白为何申公义会来句井家，但他却不发问，因为他知道申公义决计不会同他说。<p>申公义领着冉仲弓策马离开了戈壁滩，眼前的植被愈发茂盛，已然是要彻底离开沙漠的范畴。<p>马匹一路上未吃喝甚么，若不是这两匹马都乃驯良，如此奔袭早该一命呜呼。纵然如此，半个月的赶路也已费尽了这两匹马的一切精神。<p>此时它们两匹马见得嫩草，如何也迈不开腿了。<p>申公义只得将冉仲弓拉下马来，暂作休整。<p>冉仲弓被丢在树下，申公义顺手用刀鞘点了冉仲弓的穴位，松开了冉仲弓手中的牛皮绳。<p>冉仲弓眼神瞟向正在拆解马嚼子的申公义，心中微动。","volumeName":"第五卷 碧落诀"}}
     */

    private int code;
    private String msg;
    private DataBean data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * chapterInfo : {"id":26907,"uid":36927,"novelId":101,"volumeId":5,"serPath":18,"title":"第十八章 千里尤遵","introduce":"","price":0,"wordNum":2184,"status":1,"type":0,"vipCer":0,"shelfTime":1518010477,"createTime":1518010477,"updateTime":1518010477,"originalContent":"\n冉仲弓挣扎了一把，背后的绳索却是牛筋做的异常坚韧，他挣扎几番却愈来愈紧。\n申公义已然走到近前，伸手抓住冉仲弓狠狠一抛。\n冉仲弓只觉得天旋地转，随即重重地落在了马背上。他还不明所以，便见申公义用一页刀的刀鞘狠狠地抽了一下冉仲弓的马的屁股。\n那马痛得嘶鸣一声撒开前蹄疾奔而去。\n冉仲弓只觉得马背上颠簸，险些将他颠下马来。他忙发力稳住身形，转脸看向申公义的身影离自己愈来愈远。\n还未等他如何缓过神来，便见申公义翻身上了另一匹马，一夹马肚便追及而来。\n冉仲弓双手被缚无法驱策马匹，只能信马由缰，极快地便被申公义复追上。\n\u201c妈的若不是你申公明怎的会死！\u201d申公义破口骂着一把拿起刀鞘狠狠地抽在冉仲弓的后脑之上。\n冉仲弓只听见自己脑颅内\u201c梆！\u201d的一声，两眼便悠悠发蒙，身子险些支持不住跌落下马。\n那申公义驱马凑近一把揪住冉仲弓的头发用力地将冉仲弓的脸摔在马鞍上，只听见冉仲弓闷哼一声，鲜血一串串地洒落在地。\n这沙子贪婪至极，一口口将鲜血吞入腹中。\n\u201c你为何不再自作聪明了！\u201d申公义只手将冉仲弓连着马匹一同拉到身前，两眼怒视着，似乎要将一股没由来的脾气全都发在冉仲弓身上。\n冉仲弓只能感觉自己身上一次又一次地遭受重击，可他从第一下被打中了头颅就已然七荤八素，两眼直冒金星。\n\u201c你倒是答啊！此时为何不做声？！\u201d\n申公义的拳头混着刀鞘一下一下打在冉仲弓的脊背之上发着闷响。冉仲弓觉得两耳嗡嗡响，已然听不真切此人在说些甚么。\n\u201c你最好把你先前所见到的一切事都给我统统忘记！\u201d申公义将刀鞘交于另一只手，抡起巴掌狠狠一掌打在了冉仲弓的头上。\n冉仲弓闷哼一声，两眼一黑，再无知觉。\n再醒来时，冉仲弓只觉得口中干渴，头上剧痛。迷迷糊糊半天，才悠悠转醒。\n方一睁眼便见到一轮烈日，直刺他的双眼。\n冉仲弓眯着眼，一时忘记自己是谁，此地是何地，只感觉两耳充满蜂鸣声，眼前太阳的灼光都开始变了颜色。\n\u201c踏...踏...\u201d\n冉仲弓听见耳边有脚步声，紧接着模糊的视线里便出现了一个人形，将烈日遮蔽，影子刚好投射在自己的脸上。\n那人蹲下身来拿手粗鲁地扒拉开他的眼皮，冉仲弓觉得眼中不适，微微一挣。\n\u201c你娘的！装死！\u201d那人见冉仲弓尚还能动，抡圆了巴掌一耳光打将上来\u201c啪！\u201d的一声。\n冉仲弓被打的有了几分清醒，挣扎着抬头眯起眼望向那人，这才认出此人是申公义。\n\u201c你他娘为何不直接杀了我。\u201d冉仲弓干咳着，他刚刚定是被打晕了过去跌落下马吃了一嘴沙子。\n\u201c老子杀了你，谁杀了申公明？\u201d申公义一把拎着冉仲弓的后心将他一把又揪回马背上。\n这次他没再殴打冉仲弓，而是不断地开口辱骂。\n冉仲弓本身不知他为何忽然如此暴躁，可将先前的一幕幕景一句句话都串联起来便恍然。\n此人自清池山一战弃了两个同伴逃离，回到家族定少不了一番询问。\n他只能扯了个谎，好容易瞒天过海，本以为此事只有天知地知公输伯阳知，却忘记了当日和公输伯阳在一起的自己。\n而此时再度遇见，自己险些将他辛苦编的谎言一口戳破，情急之下只得再次暗算同伴，这才保住了自己。\n冉仲弓有些明白前日里酒肉烟曾同他讲的\u201c名声\u201d究竟暗藏多少含义。\n因为名声可以使人万里助拳，也可能一生被\u201c名\u201d字所累。\n可冉仲弓不敢开口嘲笑。此人是他所见的一切恶徒中最可能不由分说便将自己打死的。若是自己失言，今日怕是性命不保。\n他本身还为自己的退避有些气闷，后来他转念一想，自己尚还未寻到曲白，此时若是丢了性命那又怎行。\n如此想来他心情便平复了不少，听得那申公义的辱骂，权当是一条野狗在胡吠乱叫，自己闭上了眼不理睬，待那申公义追上先前离去的那三人后瞧他还如何啰嗦。\n可他料想不到，他同申公义一路疾驰，直赶了大半个月，都再未见到其他人的身影。\n四周的景色有荒凉逐渐再出现生机。由平原到丘陵，由海入林。\n一望无垠的沙终于也有了边界，尤遵沙漠愈来愈远了，在遥遥地戈壁边界，望了如此之久的沙黄色中出现了星星点点的绿意。\n\u201c这是何地？\u201d冉仲弓这半个月来从未主动同申公义说过话。申公义前些日子还总是开口辱骂冉仲弓，冉仲弓也从未回答。而后似乎是骂的累，亦或是未得到回应骂的烦了，近两日再未开过口。\n两个人只知道赶路，入夜了便修整。那时申公义会给冉仲弓松绑。\n冉仲弓本想等那申公义点自己的穴位，自己使出碧落诀从而脱身，可不知这申公义究竟是运气好还是有意如此，都是用一页刀的刀鞘点了他的穴位。\n次次如此。\n。\n他给冉仲弓松了绑，便将两匹马拉到一起，而后用绳子捆在自己的衣服上。\n若是冉仲弓一有异动，他便能转瞬惊醒。\n冉仲弓心知在这沙漠当中没有制服申公义，自己无论如何也没逃不脱，便不再有逃跑的念头，可他见到了眼前这几抹绿色，眼睛便忽然瞟向申公义。\n\u201c怎的？酒肉烟大侠猜测不出？\u201d申公义冷嘲热讽、\n冉仲弓心说酒肉烟老哥见多识广，肯定会知道。可自己涉世未深，未去过如何遥远的地方。只知道他们一路顺着尤遵朝南走来，若是猜得不错，此地应是句井家的地盘。\n他不明白为何申公义会来句井家，但他却不发问，因为他知道申公义决计不会同他说。\n申公义领着冉仲弓策马离开了戈壁滩，眼前的植被愈发茂盛，已然是要彻底离开沙漠的范畴。\n马匹一路上未吃喝甚么，若不是这两匹马都乃驯良，如此奔袭早该一命呜呼。纵然如此，半个月的赶路也已费尽了这两匹马的一切精神。\n此时它们两匹马见得嫩草，如何也迈不开腿了。\n申公义只得将冉仲弓拉下马来，暂作休整。\n冉仲弓被丢在树下，申公义顺手用刀鞘点了冉仲弓的穴位，松开了冉仲弓手中的牛皮绳。\n冉仲弓眼神瞟向正在拆解马嚼子的申公义，心中微动。","content":"<p>冉仲弓挣扎了一把，背后的绳索却是牛筋做的异常坚韧，他挣扎几番却愈来愈紧。<p>申公义已然走到近前，伸手抓住冉仲弓狠狠一抛。<p>冉仲弓只觉得天旋地转，随即重重地落在了马背上。他还不明所以，便见申公义用一页刀的刀鞘狠狠地抽了一下冉仲弓的马的屁股。<p>那马痛得嘶鸣一声撒开前蹄疾奔而去。<p>冉仲弓只觉得马背上颠簸，险些将他颠下马来。他忙发力稳住身形，转脸看向申公义的身影离自己愈来愈远。<p>还未等他如何缓过神来，便见申公义翻身上了另一匹马，一夹马肚便追及而来。<p>冉仲弓双手被缚无法驱策马匹，只能信马由缰，极快地便被申公义复追上。<p>\u201c妈的若不是你申公明怎的会死！\u201d申公义破口骂着一把拿起刀鞘狠狠地抽在冉仲弓的后脑之上。<p>冉仲弓只听见自己脑颅内\u201c梆！\u201d的一声，两眼便悠悠发蒙，身子险些支持不住跌落下马。<p>那申公义驱马凑近一把揪住冉仲弓的头发用力地将冉仲弓的脸摔在马鞍上，只听见冉仲弓闷哼一声，鲜血一串串地洒落在地。<p>这沙子贪婪至极，一口口将鲜血吞入腹中。<p>\u201c你为何不再自作聪明了！\u201d申公义只手将冉仲弓连着马匹一同拉到身前，两眼怒视着，似乎要将一股没由来的脾气全都发在冉仲弓身上。<p>冉仲弓只能感觉自己身上一次又一次地遭受重击，可他从第一下被打中了头颅就已然七荤八素，两眼直冒金星。<p>\u201c你倒是答啊！此时为何不做声？！\u201d<p>申公义的拳头混着刀鞘一下一下打在冉仲弓的脊背之上发着闷响。冉仲弓觉得两耳嗡嗡响，已然听不真切此人在说些甚么。<p>\u201c你最好把你先前所见到的一切事都给我统统忘记！\u201d申公义将刀鞘交于另一只手，抡起巴掌狠狠一掌打在了冉仲弓的头上。<p>冉仲弓闷哼一声，两眼一黑，再无知觉。<p>再醒来时，冉仲弓只觉得口中干渴，头上剧痛。迷迷糊糊半天，才悠悠转醒。<p>方一睁眼便见到一轮烈日，直刺他的双眼。<p>冉仲弓眯着眼，一时忘记自己是谁，此地是何地，只感觉两耳充满蜂鸣声，眼前太阳的灼光都开始变了颜色。<p>\u201c踏...踏...\u201d<p>冉仲弓听见耳边有脚步声，紧接着模糊的视线里便出现了一个人形，将烈日遮蔽，影子刚好投射在自己的脸上。<p>那人蹲下身来拿手粗鲁地扒拉开他的眼皮，冉仲弓觉得眼中不适，微微一挣。<p>\u201c你娘的！装死！\u201d那人见冉仲弓尚还能动，抡圆了巴掌一耳光打将上来\u201c啪！\u201d的一声。<p>冉仲弓被打的有了几分清醒，挣扎着抬头眯起眼望向那人，这才认出此人是申公义。<p>\u201c你他娘为何不直接杀了我。\u201d冉仲弓干咳着，他刚刚定是被打晕了过去跌落下马吃了一嘴沙子。<p>\u201c老子杀了你，谁杀了申公明？\u201d申公义一把拎着冉仲弓的后心将他一把又揪回马背上。<p>这次他没再殴打冉仲弓，而是不断地开口辱骂。<p>冉仲弓本身不知他为何忽然如此暴躁，可将先前的一幕幕景一句句话都串联起来便恍然。<p>此人自清池山一战弃了两个同伴逃离，回到家族定少不了一番询问。<p>他只能扯了个谎，好容易瞒天过海，本以为此事只有天知地知公输伯阳知，却忘记了当日和公输伯阳在一起的自己。<p>而此时再度遇见，自己险些将他辛苦编的谎言一口戳破，情急之下只得再次暗算同伴，这才保住了自己。<p>冉仲弓有些明白前日里酒肉烟曾同他讲的\u201c名声\u201d究竟暗藏多少含义。<p>因为名声可以使人万里助拳，也可能一生被\u201c名\u201d字所累。<p>可冉仲弓不敢开口嘲笑。此人是他所见的一切恶徒中最可能不由分说便将自己打死的。若是自己失言，今日怕是性命不保。<p>他本身还为自己的退避有些气闷，后来他转念一想，自己尚还未寻到曲白，此时若是丢了性命那又怎行。<p>如此想来他心情便平复了不少，听得那申公义的辱骂，权当是一条野狗在胡吠乱叫，自己闭上了眼不理睬，待那申公义追上先前离去的那三人后瞧他还如何啰嗦。<p>可他料想不到，他同申公义一路疾驰，直赶了大半个月，都再未见到其他人的身影。<p>四周的景色有荒凉逐渐再出现生机。由平原到丘陵，由海入林。<p>一望无垠的沙终于也有了边界，尤遵沙漠愈来愈远了，在遥遥地戈壁边界，望了如此之久的沙黄色中出现了星星点点的绿意。<p>\u201c这是何地？\u201d冉仲弓这半个月来从未主动同申公义说过话。申公义前些日子还总是开口辱骂冉仲弓，冉仲弓也从未回答。而后似乎是骂的累，亦或是未得到回应骂的烦了，近两日再未开过口。<p>两个人只知道赶路，入夜了便修整。那时申公义会给冉仲弓松绑。<p>冉仲弓本想等那申公义点自己的穴位，自己使出碧落诀从而脱身，可不知这申公义究竟是运气好还是有意如此，都是用一页刀的刀鞘点了他的穴位。<p>次次如此。<p>。<p>他给冉仲弓松了绑，便将两匹马拉到一起，而后用绳子捆在自己的衣服上。<p>若是冉仲弓一有异动，他便能转瞬惊醒。<p>冉仲弓心知在这沙漠当中没有制服申公义，自己无论如何也没逃不脱，便不再有逃跑的念头，可他见到了眼前这几抹绿色，眼睛便忽然瞟向申公义。<p>\u201c怎的？酒肉烟大侠猜测不出？\u201d申公义冷嘲热讽、<p>冉仲弓心说酒肉烟老哥见多识广，肯定会知道。可自己涉世未深，未去过如何遥远的地方。只知道他们一路顺着尤遵朝南走来，若是猜得不错，此地应是句井家的地盘。<p>他不明白为何申公义会来句井家，但他却不发问，因为他知道申公义决计不会同他说。<p>申公义领着冉仲弓策马离开了戈壁滩，眼前的植被愈发茂盛，已然是要彻底离开沙漠的范畴。<p>马匹一路上未吃喝甚么，若不是这两匹马都乃驯良，如此奔袭早该一命呜呼。纵然如此，半个月的赶路也已费尽了这两匹马的一切精神。<p>此时它们两匹马见得嫩草，如何也迈不开腿了。<p>申公义只得将冉仲弓拉下马来，暂作休整。<p>冉仲弓被丢在树下，申公义顺手用刀鞘点了冉仲弓的穴位，松开了冉仲弓手中的牛皮绳。<p>冉仲弓眼神瞟向正在拆解马嚼子的申公义，心中微动。","volumeName":"第五卷 碧落诀"}
         */

        private ChapterInfoBean chapterInfo;

        public ChapterInfoBean getChapterInfo() {
            return chapterInfo;
        }

        public void setChapterInfo(ChapterInfoBean chapterInfo) {
            this.chapterInfo = chapterInfo;
        }

        public static class ChapterInfoBean {
            /**
             * id : 26907
             * uid : 36927
             * novelId : 101
             * volumeId : 5
             * serPath : 18
             * title : 第十八章 千里尤遵
             * introduce :
             * price : 0
             * wordNum : 2184
             * status : 1
             * type : 0
             * vipCer : 0
             * shelfTime : 1518010477
             * createTime : 1518010477
             * updateTime : 1518010477
             * originalContent :
             冉仲弓挣扎了一把，背后的绳索却是牛筋做的异常坚韧，他挣扎几番却愈来愈紧。
             申公义已然走到近前，伸手抓住冉仲弓狠狠一抛。
             冉仲弓只觉得天旋地转，随即重重地落在了马背上。他还不明所以，便见申公义用一页刀的刀鞘狠狠地抽了一下冉仲弓的马的屁股。
             那马痛得嘶鸣一声撒开前蹄疾奔而去。
             冉仲弓只觉得马背上颠簸，险些将他颠下马来。他忙发力稳住身形，转脸看向申公义的身影离自己愈来愈远。
             还未等他如何缓过神来，便见申公义翻身上了另一匹马，一夹马肚便追及而来。
             冉仲弓双手被缚无法驱策马匹，只能信马由缰，极快地便被申公义复追上。
             “妈的若不是你申公明怎的会死！”申公义破口骂着一把拿起刀鞘狠狠地抽在冉仲弓的后脑之上。
             冉仲弓只听见自己脑颅内“梆！”的一声，两眼便悠悠发蒙，身子险些支持不住跌落下马。
             那申公义驱马凑近一把揪住冉仲弓的头发用力地将冉仲弓的脸摔在马鞍上，只听见冉仲弓闷哼一声，鲜血一串串地洒落在地。
             这沙子贪婪至极，一口口将鲜血吞入腹中。
             “你为何不再自作聪明了！”申公义只手将冉仲弓连着马匹一同拉到身前，两眼怒视着，似乎要将一股没由来的脾气全都发在冉仲弓身上。
             冉仲弓只能感觉自己身上一次又一次地遭受重击，可他从第一下被打中了头颅就已然七荤八素，两眼直冒金星。
             “你倒是答啊！此时为何不做声？！”
             申公义的拳头混着刀鞘一下一下打在冉仲弓的脊背之上发着闷响。冉仲弓觉得两耳嗡嗡响，已然听不真切此人在说些甚么。
             “你最好把你先前所见到的一切事都给我统统忘记！”申公义将刀鞘交于另一只手，抡起巴掌狠狠一掌打在了冉仲弓的头上。
             冉仲弓闷哼一声，两眼一黑，再无知觉。
             再醒来时，冉仲弓只觉得口中干渴，头上剧痛。迷迷糊糊半天，才悠悠转醒。
             方一睁眼便见到一轮烈日，直刺他的双眼。
             冉仲弓眯着眼，一时忘记自己是谁，此地是何地，只感觉两耳充满蜂鸣声，眼前太阳的灼光都开始变了颜色。
             “踏...踏...”
             冉仲弓听见耳边有脚步声，紧接着模糊的视线里便出现了一个人形，将烈日遮蔽，影子刚好投射在自己的脸上。
             那人蹲下身来拿手粗鲁地扒拉开他的眼皮，冉仲弓觉得眼中不适，微微一挣。
             “你娘的！装死！”那人见冉仲弓尚还能动，抡圆了巴掌一耳光打将上来“啪！”的一声。
             冉仲弓被打的有了几分清醒，挣扎着抬头眯起眼望向那人，这才认出此人是申公义。
             “你他娘为何不直接杀了我。”冉仲弓干咳着，他刚刚定是被打晕了过去跌落下马吃了一嘴沙子。
             “老子杀了你，谁杀了申公明？”申公义一把拎着冉仲弓的后心将他一把又揪回马背上。
             这次他没再殴打冉仲弓，而是不断地开口辱骂。
             冉仲弓本身不知他为何忽然如此暴躁，可将先前的一幕幕景一句句话都串联起来便恍然。
             此人自清池山一战弃了两个同伴逃离，回到家族定少不了一番询问。
             他只能扯了个谎，好容易瞒天过海，本以为此事只有天知地知公输伯阳知，却忘记了当日和公输伯阳在一起的自己。
             而此时再度遇见，自己险些将他辛苦编的谎言一口戳破，情急之下只得再次暗算同伴，这才保住了自己。
             冉仲弓有些明白前日里酒肉烟曾同他讲的“名声”究竟暗藏多少含义。
             因为名声可以使人万里助拳，也可能一生被“名”字所累。
             可冉仲弓不敢开口嘲笑。此人是他所见的一切恶徒中最可能不由分说便将自己打死的。若是自己失言，今日怕是性命不保。
             他本身还为自己的退避有些气闷，后来他转念一想，自己尚还未寻到曲白，此时若是丢了性命那又怎行。
             如此想来他心情便平复了不少，听得那申公义的辱骂，权当是一条野狗在胡吠乱叫，自己闭上了眼不理睬，待那申公义追上先前离去的那三人后瞧他还如何啰嗦。
             可他料想不到，他同申公义一路疾驰，直赶了大半个月，都再未见到其他人的身影。
             四周的景色有荒凉逐渐再出现生机。由平原到丘陵，由海入林。
             一望无垠的沙终于也有了边界，尤遵沙漠愈来愈远了，在遥遥地戈壁边界，望了如此之久的沙黄色中出现了星星点点的绿意。
             “这是何地？”冉仲弓这半个月来从未主动同申公义说过话。申公义前些日子还总是开口辱骂冉仲弓，冉仲弓也从未回答。而后似乎是骂的累，亦或是未得到回应骂的烦了，近两日再未开过口。
             两个人只知道赶路，入夜了便修整。那时申公义会给冉仲弓松绑。
             冉仲弓本想等那申公义点自己的穴位，自己使出碧落诀从而脱身，可不知这申公义究竟是运气好还是有意如此，都是用一页刀的刀鞘点了他的穴位。
             次次如此。
             。
             他给冉仲弓松了绑，便将两匹马拉到一起，而后用绳子捆在自己的衣服上。
             若是冉仲弓一有异动，他便能转瞬惊醒。
             冉仲弓心知在这沙漠当中没有制服申公义，自己无论如何也没逃不脱，便不再有逃跑的念头，可他见到了眼前这几抹绿色，眼睛便忽然瞟向申公义。
             “怎的？酒肉烟大侠猜测不出？”申公义冷嘲热讽、
             冉仲弓心说酒肉烟老哥见多识广，肯定会知道。可自己涉世未深，未去过如何遥远的地方。只知道他们一路顺着尤遵朝南走来，若是猜得不错，此地应是句井家的地盘。
             他不明白为何申公义会来句井家，但他却不发问，因为他知道申公义决计不会同他说。
             申公义领着冉仲弓策马离开了戈壁滩，眼前的植被愈发茂盛，已然是要彻底离开沙漠的范畴。
             马匹一路上未吃喝甚么，若不是这两匹马都乃驯良，如此奔袭早该一命呜呼。纵然如此，半个月的赶路也已费尽了这两匹马的一切精神。
             此时它们两匹马见得嫩草，如何也迈不开腿了。
             申公义只得将冉仲弓拉下马来，暂作休整。
             冉仲弓被丢在树下，申公义顺手用刀鞘点了冉仲弓的穴位，松开了冉仲弓手中的牛皮绳。
             冉仲弓眼神瞟向正在拆解马嚼子的申公义，心中微动。
             * content : <p>冉仲弓挣扎了一把，背后的绳索却是牛筋做的异常坚韧，他挣扎几番却愈来愈紧。<p>申公义已然走到近前，伸手抓住冉仲弓狠狠一抛。<p>冉仲弓只觉得天旋地转，随即重重地落在了马背上。他还不明所以，便见申公义用一页刀的刀鞘狠狠地抽了一下冉仲弓的马的屁股。<p>那马痛得嘶鸣一声撒开前蹄疾奔而去。<p>冉仲弓只觉得马背上颠簸，险些将他颠下马来。他忙发力稳住身形，转脸看向申公义的身影离自己愈来愈远。<p>还未等他如何缓过神来，便见申公义翻身上了另一匹马，一夹马肚便追及而来。<p>冉仲弓双手被缚无法驱策马匹，只能信马由缰，极快地便被申公义复追上。<p>“妈的若不是你申公明怎的会死！”申公义破口骂着一把拿起刀鞘狠狠地抽在冉仲弓的后脑之上。<p>冉仲弓只听见自己脑颅内“梆！”的一声，两眼便悠悠发蒙，身子险些支持不住跌落下马。<p>那申公义驱马凑近一把揪住冉仲弓的头发用力地将冉仲弓的脸摔在马鞍上，只听见冉仲弓闷哼一声，鲜血一串串地洒落在地。<p>这沙子贪婪至极，一口口将鲜血吞入腹中。<p>“你为何不再自作聪明了！”申公义只手将冉仲弓连着马匹一同拉到身前，两眼怒视着，似乎要将一股没由来的脾气全都发在冉仲弓身上。<p>冉仲弓只能感觉自己身上一次又一次地遭受重击，可他从第一下被打中了头颅就已然七荤八素，两眼直冒金星。<p>“你倒是答啊！此时为何不做声？！”<p>申公义的拳头混着刀鞘一下一下打在冉仲弓的脊背之上发着闷响。冉仲弓觉得两耳嗡嗡响，已然听不真切此人在说些甚么。<p>“你最好把你先前所见到的一切事都给我统统忘记！”申公义将刀鞘交于另一只手，抡起巴掌狠狠一掌打在了冉仲弓的头上。<p>冉仲弓闷哼一声，两眼一黑，再无知觉。<p>再醒来时，冉仲弓只觉得口中干渴，头上剧痛。迷迷糊糊半天，才悠悠转醒。<p>方一睁眼便见到一轮烈日，直刺他的双眼。<p>冉仲弓眯着眼，一时忘记自己是谁，此地是何地，只感觉两耳充满蜂鸣声，眼前太阳的灼光都开始变了颜色。<p>“踏...踏...”<p>冉仲弓听见耳边有脚步声，紧接着模糊的视线里便出现了一个人形，将烈日遮蔽，影子刚好投射在自己的脸上。<p>那人蹲下身来拿手粗鲁地扒拉开他的眼皮，冉仲弓觉得眼中不适，微微一挣。<p>“你娘的！装死！”那人见冉仲弓尚还能动，抡圆了巴掌一耳光打将上来“啪！”的一声。<p>冉仲弓被打的有了几分清醒，挣扎着抬头眯起眼望向那人，这才认出此人是申公义。<p>“你他娘为何不直接杀了我。”冉仲弓干咳着，他刚刚定是被打晕了过去跌落下马吃了一嘴沙子。<p>“老子杀了你，谁杀了申公明？”申公义一把拎着冉仲弓的后心将他一把又揪回马背上。<p>这次他没再殴打冉仲弓，而是不断地开口辱骂。<p>冉仲弓本身不知他为何忽然如此暴躁，可将先前的一幕幕景一句句话都串联起来便恍然。<p>此人自清池山一战弃了两个同伴逃离，回到家族定少不了一番询问。<p>他只能扯了个谎，好容易瞒天过海，本以为此事只有天知地知公输伯阳知，却忘记了当日和公输伯阳在一起的自己。<p>而此时再度遇见，自己险些将他辛苦编的谎言一口戳破，情急之下只得再次暗算同伴，这才保住了自己。<p>冉仲弓有些明白前日里酒肉烟曾同他讲的“名声”究竟暗藏多少含义。<p>因为名声可以使人万里助拳，也可能一生被“名”字所累。<p>可冉仲弓不敢开口嘲笑。此人是他所见的一切恶徒中最可能不由分说便将自己打死的。若是自己失言，今日怕是性命不保。<p>他本身还为自己的退避有些气闷，后来他转念一想，自己尚还未寻到曲白，此时若是丢了性命那又怎行。<p>如此想来他心情便平复了不少，听得那申公义的辱骂，权当是一条野狗在胡吠乱叫，自己闭上了眼不理睬，待那申公义追上先前离去的那三人后瞧他还如何啰嗦。<p>可他料想不到，他同申公义一路疾驰，直赶了大半个月，都再未见到其他人的身影。<p>四周的景色有荒凉逐渐再出现生机。由平原到丘陵，由海入林。<p>一望无垠的沙终于也有了边界，尤遵沙漠愈来愈远了，在遥遥地戈壁边界，望了如此之久的沙黄色中出现了星星点点的绿意。<p>“这是何地？”冉仲弓这半个月来从未主动同申公义说过话。申公义前些日子还总是开口辱骂冉仲弓，冉仲弓也从未回答。而后似乎是骂的累，亦或是未得到回应骂的烦了，近两日再未开过口。<p>两个人只知道赶路，入夜了便修整。那时申公义会给冉仲弓松绑。<p>冉仲弓本想等那申公义点自己的穴位，自己使出碧落诀从而脱身，可不知这申公义究竟是运气好还是有意如此，都是用一页刀的刀鞘点了他的穴位。<p>次次如此。<p>。<p>他给冉仲弓松了绑，便将两匹马拉到一起，而后用绳子捆在自己的衣服上。<p>若是冉仲弓一有异动，他便能转瞬惊醒。<p>冉仲弓心知在这沙漠当中没有制服申公义，自己无论如何也没逃不脱，便不再有逃跑的念头，可他见到了眼前这几抹绿色，眼睛便忽然瞟向申公义。<p>“怎的？酒肉烟大侠猜测不出？”申公义冷嘲热讽、<p>冉仲弓心说酒肉烟老哥见多识广，肯定会知道。可自己涉世未深，未去过如何遥远的地方。只知道他们一路顺着尤遵朝南走来，若是猜得不错，此地应是句井家的地盘。<p>他不明白为何申公义会来句井家，但他却不发问，因为他知道申公义决计不会同他说。<p>申公义领着冉仲弓策马离开了戈壁滩，眼前的植被愈发茂盛，已然是要彻底离开沙漠的范畴。<p>马匹一路上未吃喝甚么，若不是这两匹马都乃驯良，如此奔袭早该一命呜呼。纵然如此，半个月的赶路也已费尽了这两匹马的一切精神。<p>此时它们两匹马见得嫩草，如何也迈不开腿了。<p>申公义只得将冉仲弓拉下马来，暂作休整。<p>冉仲弓被丢在树下，申公义顺手用刀鞘点了冉仲弓的穴位，松开了冉仲弓手中的牛皮绳。<p>冉仲弓眼神瞟向正在拆解马嚼子的申公义，心中微动。
             * volumeName : 第五卷 碧落诀
             */

            private int id;
            private int uid;
            private int novelId;
            private int volumeId;
            private int serPath;
            private String title;
            private String introduce;
            private int price;
            private int wordNum;
            private int status;
            private int type;
            private int vipCer;
            private Long shelfTime;
            private Long createTime;
            private Long updateTime;
            private String originalContent;
            private String content;
            private String volumeName;

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public int getUid() {
                return uid;
            }

            public void setUid(int uid) {
                this.uid = uid;
            }

            public int getNovelId() {
                return novelId;
            }

            public void setNovelId(int novelId) {
                this.novelId = novelId;
            }

            public int getVolumeId() {
                return volumeId;
            }

            public void setVolumeId(int volumeId) {
                this.volumeId = volumeId;
            }

            public int getSerPath() {
                return serPath;
            }

            public void setSerPath(int serPath) {
                this.serPath = serPath;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getIntroduce() {
                return introduce;
            }

            public void setIntroduce(String introduce) {
                this.introduce = introduce;
            }

            public int getPrice() {
                return price;
            }

            public void setPrice(int price) {
                this.price = price;
            }

            public String getWordNum() {
                return  RxTool.getWordNumFormat(String.valueOf(wordNum));
            }

            public void setWordNum(int wordNum) {
                this.wordNum = wordNum;
            }

            public int getStatus() {
                return status;
            }

            public void setStatus(int status) {
                this.status = status;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public int getVipCer() {
                return vipCer;
            }

            public void setVipCer(int vipCer) {
                this.vipCer = vipCer;
            }


            public String getOriginalContent() {
                return originalContent;
            }

            public Long getShelfTime() {
                return shelfTime;
            }

            public void setShelfTime(Long shelfTime) {
                this.shelfTime = shelfTime;
            }

            public Long getCreateTime() {
                return createTime;
            }

            public void setCreateTime(Long createTime) {
                this.createTime = createTime;
            }

            public Long getUpdateTime() {
                return updateTime;
            }

            public void setUpdateTime(Long updateTime) {
                this.updateTime = updateTime;
            }

            public void setOriginalContent(String originalContent) {
                this.originalContent = originalContent;
            }

            public String getContent() {
                content=content.replace("<p>","\n").replace("</p>","\n");
                return RxTool.filterChar(content);
            }

            public void setContent(String content) {
                this.content = content;
            }

            public String getVolumeName() {
                return volumeName;
            }

            public void setVolumeName(String volumeName) {
                this.volumeName = volumeName;
            }
        }
    }
}
