package com.lianzai.reader.bean;

import com.lianzai.reader.utils.RxDataTool;

import java.io.Serializable;
import java.util.List;

/**
 * Created by lrz on 2017/11/29.
 */

public class MessageBean  implements Serializable{

    /**
     * status_code : 200
     * data : {"current_page":1,"data":[{"id":2,"type":7,"content":{"title":"疯狂小强：放心吧，认真做事的人，都不会差","content":"<a href='http://www.qq.com'>连载神器<\/a>是一个全新的网络文学原创内容平台，<a href='http://www.baidu.com'>连载神器<\/a>连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。"},"create_time":"2017-11-02 19:34:14","deleted_at":"2017-11-28 17:00:37"},{"id":1,"type":7,"content":{"title":"关于我们","content":"<a href='http://www.qq.com'>连载神器<\/a>是一个全新的网络文学原创内容平台，<a href='http://www.baidu.com'>连载神器<\/a>连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。"},"create_time":"2017-10-18 16:22:29","deleted_at":"2017-10-26 14:16:23"}],"from":1,"last_page":1,"next_page_url":null,"path":"http://beta.wallet.lianzai.com:8089/api/inform/lists/7","per_page":10,"prev_page_url":null,"to":2,"total":2}
     */

    private int status_code;
    private DataBeanX data;

    public int getStatus_code() {
        return status_code;
    }

    public void setStatus_code(int status_code) {
        this.status_code = status_code;
    }

    public DataBeanX getData() {
        return data;
    }

    public void setData(DataBeanX data) {
        this.data = data;
    }

    public static class DataBeanX implements Serializable{
        /**
         * current_page : 1
         * data : [{"id":2,"type":7,"content":{"title":"疯狂小强：放心吧，认真做事的人，都不会差","content":"<a href='http://www.qq.com'>连载神器<\/a>是一个全新的网络文学原创内容平台，<a href='http://www.baidu.com'>连载神器<\/a>连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。"},"create_time":"2017-11-02 19:34:14","deleted_at":"2017-11-28 17:00:37"},{"id":1,"type":7,"content":{"title":"关于我们","content":"<a href='http://www.qq.com'>连载神器<\/a>是一个全新的网络文学原创内容平台，<a href='http://www.baidu.com'>连载神器<\/a>连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。"},"create_time":"2017-10-18 16:22:29","deleted_at":"2017-10-26 14:16:23"}]
         * from : 1
         * last_page : 1
         * next_page_url : null
         * path : http://beta.wallet.lianzai.com:8089/api/inform/lists/7
         * per_page : 10
         * prev_page_url : null
         * to : 2
         * total : 2
         */

        private List<DataBean> data;

        public List<DataBean> getData() {
            return data;
        }

        public void setData(List<DataBean> data) {
            this.data = data;
        }

        public static class DataBean implements Serializable {
            /**
             * id : 2
             * type : 7
             * content : {"title":"疯狂小强：放心吧，认真做事的人，都不会差","content":"<a href='http://www.qq.com'>连载神器<\/a>是一个全新的网络文学原创内容平台，<a href='http://www.baidu.com'>连载神器<\/a>连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。连载神器是一个全新的网络文学原创内容平台，我们希望用全新的模式和规则，给中国的网络文学带来一点不同的东西，给创作者多一个选择。\r\n在这里，你将体会到焕然一新的写作体验和反馈激励，无论是玄幻、仙侠等主流题材，还是脑洞、二次元、亚文化等小众题材，你都可以畅快发表，我们将竭尽所能，给您带来前所未有的写作自由和读者社群运营支持。\r\n以文会友觅知音！\r\n我们坚信，真正用心创作的作品，必然能够找到懂得欣赏的知音读者。\r\n我们坚信，只需要1000名忠实读者，就能支撑作者坚持创作下去。\r\n我们坚信，创作者应该享受对等的自由、尊严，以及相应的稿酬。\r\n喜爱创作的你，从现在开始，拿起你的笔，在连载神器写出自己的故事，在这里你可以找到真正欣赏你的作品的人。"}
             * create_time : 2017-11-02 19:34:14
             * deleted_at : 2017-11-28 17:00:37
             */

            private int id;
            private int type;
            private ContentBean content;
            private String create_time;
            private String deleted_at;

            private String url;

            public String getUrl() {
                return url;
            }

            public void setUrl(String url) {
                this.url = url;
            }

            public boolean isRead(){
                return RxDataTool.isEmpty(deleted_at)||deleted_at.equals("false")?false:true;
            }

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public ContentBean getContent() {
                return content;
            }

            public void setContent(ContentBean content) {
                this.content = content;
            }

            public String getCreate_time() {
                return create_time;
            }

            public void setCreate_time(String create_time) {
                this.create_time = create_time;
            }

            public String getDeleted_at() {
                return deleted_at;
            }

            public void setDeleted_at(String deleted_at) {
                this.deleted_at = deleted_at;
            }

            public static class ContentBean implements Serializable{

                private String title;
                private String content;



                private String tranId;//交易ID
                private String tranType;//交易类型


                public String getTranId() {
                    return tranId;
                }

                public void setTranId(String tranId) {
                    this.tranId = tranId;
                }

                public String getTranType() {
                    return tranType;
                }

                public void setTranType(String tranType) {
                    this.tranType = tranType;
                }

                public String getTitle() {
                    return title;
                }

                public void setTitle(String title) {
                    this.title = title;
                }

                public String getContent() {
                    return content;
                }

                public void setContent(String content) {
                    this.content = content;
                }
            }
        }
    }
}
